In [1]:
import datetime as dt
import pandas as pd
import calendar

In [3]:
todaydate = dt.date.today()

In [4]:
todaydate

datetime.date(2024, 6, 28)

In [5]:
%whos

Variable          Type             Data/Info
--------------------------------------------
NamespaceMagics   MetaHasTraits    <class 'IPython.core.magi<...>mespace.NamespaceMagics'>
dt                module           <module 'datetime' from '<...>b/python3.9/datetime.py'>
get_ipython       function         <function get_ipython at 0x106a08670>
json              module           <module 'json' from '/opt<...>hon3.9/json/__init__.py'>
pd                module           <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
sys               module           <module 'sys' (built-in)>
todaydate         date             2024-06-28

In [6]:
type(todaydate)

datetime.date

In [7]:
print(todaydate)

2024-06-28

In [9]:
datetimetoday = dt.datetime.now()

In [10]:
type(datetimetoday)

datetime.datetime

In [11]:
%whos

Variable          Type             Data/Info
--------------------------------------------
NamespaceMagics   MetaHasTraits    <class 'IPython.core.magi<...>mespace.NamespaceMagics'>
datetimetoday     datetime         2024-06-28 17:20:47.882160
dt                module           <module 'datetime' from '<...>b/python3.9/datetime.py'>
get_ipython       function         <function get_ipython at 0x106a08670>
json              module           <module 'json' from '/opt<...>hon3.9/json/__init__.py'>
pd                module           <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
sys               module           <module 'sys' (built-in)>
todaydate         date             2024-06-28

In [12]:
print(datetimetoday)

2024-06-28 17:20:47.882160

In [13]:
dt.datetime.now()

datetime.datetime(2024, 6, 28, 17, 23, 32, 64994)

In [23]:
print(dt.datetime(2000, 12, 31))

ValueError: month must be in 1..12

In [18]:
dt.datetime('2000-12-31')

TypeError: an integer is required (got type str)

In [20]:
print(pd.to_datetime('2001-12-31'))

2001-12-31 00:00:00

In [21]:
print(pd.to_datetime('2001/12/31'))

2001-12-31 00:00:00

In [22]:
print(pd.to_datetime('12-31-2001'))

2001-12-31 00:00:00

In [24]:
pd.to_datetime('December 31, 2021')

Timestamp('2021-12-31 00:00:00')

In [76]:
('' # add a blank
     .join('Jan*22*2024' # join to concat the list items
           .upper() # uppercase what is in the list
           .split('*')) # split the text by "*" into a list
)

'JAN222024'

In [65]:
''.join('Jan*22*2024'.split('*'))

'Jan222024'

In [78]:
pd.to_datetime('Jan*22*2024', format='%b*%d*%Y')

Timestamp('2024-01-22 00:00:00')

In [26]:
pd.to_datetime('20211231')

Timestamp('2021-12-31 00:00:00')

In [35]:
try:
    pd.to_datetime('Saturday, January 1, 2022', format = '%A, %B %d, %y')
except:
    print('error')

error

In [56]:
print('hello \\t world')

hello \t world

In [ ]:
Jan*22*2024'

In [85]:
df = pd.read_csv('test.csv', 
                     parse_dates=['Date'],
                     date_format='%b*%d*%Y' # assuming date is coming as JAN*31*2024
                )

In [92]:
df = pd.DataFrame(pd.date_range(start='2021-01-01', end='2021-02-01'), columns=['Date'])

In [103]:
'hello world'.replace('o', '****')

'hell**** w****rld'

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    32 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 384.0 bytes

In [101]:
df['day name'] = df['Date'].dt.day_name()
df['month'] = df['Date'].dt.month
df['month name'] = df['Date'].dt.month_name()
df['quarter'] = df['Date'].dt.quarter
df['is_quarter_start'] = df['Date'].dt.is_quarter_start
df['days_in_month'] = df['Date'].dt.days_in_month
df['is_leap_year'] = df['Date'].dt.is_leap_year
df['is_month_start'] = df['Date'].dt.is_month_start
df['is_month_end'] = df['Date'].dt.is_month_end
df['is_year_start'] = df['Date'].dt.is_year_start

In [105]:
df['day name'].str.replace('a', '***')

0         Frid***y
1     S***turd***y
2         Sund***y
3         Mond***y
4        Tuesd***y
5      Wednesd***y
6       Thursd***y
7         Frid***y
8     S***turd***y
9         Sund***y
10        Mond***y
11       Tuesd***y
12     Wednesd***y
13      Thursd***y
14        Frid***y
15    S***turd***y
16        Sund***y
17        Mond***y
18       Tuesd***y
19     Wednesd***y
20      Thursd***y
21        Frid***y
22    S***turd***y
23        Sund***y
24        Mond***y
25       Tuesd***y
26     Wednesd***y
27      Thursd***y
28        Frid***y
29    S***turd***y
30        Sund***y
31        Mond***y
Name: day name, dtype: object

In [118]:
pd.to_datetime(['Something 2021', '2021 Jan', 'Jan 1, 2021', 'April 1, 2021', '12/31/2021'], errors='coerce')

/var/folders/48/j6k669vx63qd_68k2_502cl40000gn/T/ipykernel_21508/3604549807.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(['Something 2021', '2021 Jan', 'Jan 1, 2021', 'April 1, 2021', '12/31/2021'], errors='coerce')

DatetimeIndex(['NaT', '2021-01-01', '2021-01-01', '2021-04-01', '2021-12-31'], dtype='datetime64[ns]', freq=None)

In [120]:
import numpy as np

In [121]:
pd.DataFrame({'missing types' : [pd.NaT, pd.NA, np.NaN, None]})

  missing types
0           NaT
1          <NA>
2           NaN
3          None

In [122]:
hello = None

In [125]:
hello

In [134]:
co2 = pd.read_csv('../datasets/co2_missing.csv', 
                 index_col='year',
                 parse_dates=['year'])

In [142]:
mask = co2.isna()

In [146]:
mask

              co2
year
1750-01-01  False
1760-01-01  False
1770-01-01  False
1780-01-01  False
1790-01-01  False
...           ...
2016-01-01  False
2017-01-01  False
2018-01-01  False
2019-01-01  False
2020-01-01  False

[226 rows x 1 columns]

In [140]:
co2[190:195]

               co2
year
1985-01-01     NaN
1986-01-01     NaN
1987-01-01     NaN
1988-01-01  4.2953
1989-01-01  4.2782

In [144]:
co2[mask.index]

            co2
year
1750-01-01  NaN
1760-01-01  NaN
1770-01-01  NaN
1780-01-01  NaN
1790-01-01  NaN
...         ...
2016-01-01  NaN
2017-01-01  NaN
2018-01-01  NaN
2019-01-01  NaN
2020-01-01  NaN

[226 rows x 1 columns]

In [164]:
new = pd.read_csv('missing.csv', 
                      date_format='%b*%d*%Y', 
                      index_col='Date',
                        na_values={'<NO>', '?'})

In [165]:
new.isna().sum()

Sales    9
dtype: int64

In [168]:
new.reset_index(inplace=True)

In [171]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24 non-null     datetime64[ns]
 1   Sales   15 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 512.0 bytes

In [172]:
new

         Date   Sales
0  2022-01-31     NaN
1  2023-01-31     NaN
2  2024-01-31     NaN
3  2025-01-31     NaN
4  2026-01-31     NaN
5  2027-01-31     NaN
6  2028-01-31     NaN
7  2029-01-31     NaN
8  2030-01-31     NaN
9  2031-01-31  3981.0
10 2032-01-31  6082.0
11 2033-01-31  2944.0
12 2034-01-31  7300.0
13 2035-01-31  2588.0
14 2036-01-31  8054.0
15 2037-01-31  4598.0
16 2038-01-31  4449.0
17 2039-01-31  6088.0
18 2040-01-31  3697.0
19 2041-01-31  5673.0
20 2042-01-31  7195.0
21 2043-01-31  7185.0
22 2044-01-31  6931.0
23 2045-01-31  5757.0

In [173]:
new.to_csv('test1.csv', index=False)
new.to_parquet('test1.parquet', index=False)

In [186]:
new.set_index('Date', inplace=True)

In [188]:
new.head()

            Sales
Date
2022-01-31    NaN
2023-01-31    NaN
2024-01-31    NaN
2025-01-31    NaN
2026-01-31    NaN

In [197]:
new

             Sales
Date
2022-01-31     NaN
2023-01-31     NaN
2024-01-31     NaN
2025-01-31     NaN
2026-01-31     NaN
2027-01-31     NaN
2028-01-31     NaN
2029-01-31     NaN
2030-01-31     NaN
2031-01-31  3981.0
2032-01-31  6082.0
2033-01-31  2944.0
2034-01-31  7300.0
2035-01-31  2588.0
2036-01-31  8054.0
2037-01-31  4598.0
2038-01-31  4449.0
2039-01-31  6088.0
2040-01-31  3697.0
2041-01-31  5673.0
2042-01-31  7195.0
2043-01-31  7185.0
2044-01-31  6931.0
2045-01-31  5757.0

In [198]:
new.to_csv('test1.csv')

In [194]:
new.to_parquet('test1.parquet')

In [199]:
new_csv_read = pd.read_csv('test1.csv')

In [178]:
new_csv_read.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24 non-null     object
 1   Sales   15 non-null     float64
dtypes: float64(1), object(1)
memory usage: 512.0+ bytes

In [195]:
new_parquet_read = pd.read_parquet('test1.parquet')

In [196]:
new_parquet_read.head()

            Sales
Date
2022-01-31    NaN
2023-01-31    NaN
2024-01-31    NaN
2025-01-31    NaN
2026-01-31    NaN

In [200]:
new_csv_read.head()

         Date  Sales
0  2022-01-31    NaN
1  2023-01-31    NaN
2  2024-01-31    NaN
3  2025-01-31    NaN
4  2026-01-31    NaN

In [192]:
new_parquet_read.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   15 non-null     float64
dtypes: float64(1)
memory usage: 320.0 bytes

In [219]:
time.time()

1719586207.032877

In [222]:
dt.datetime.now()

datetime.datetime(2024, 6, 28, 18, 50, 32, 48854)

In [201]:
import time

In [239]:
t = pd.to_datetime(dt.datetime.now())

In [224]:
print(t)

2024-06-28 18:50:39.828934

In [209]:
import datetime as dt

In [211]:
print(dt.datetime.now())

2024-06-28 18:45:24.157665

In [249]:
t.tz_localize('US/Eastern')

Timestamp('2024-06-28 18:55:40.590971-0400', tz='US/Eastern')

Timestamp('2024-06-28 18:55:40.590971')

In [250]:
pd.date_range(start='1/1/2021', periods=10)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [251]:
new_parquet_read.head()

            Sales
Date
2022-01-31    NaN
2023-01-31    NaN
2024-01-31    NaN
2025-01-31    NaN
2026-01-31    NaN

In [252]:
new_parquet_read.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 24 entries, 2022-01-31 to 2045-01-31
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   15 non-null     float64
dtypes: float64(1)
memory usage: 384.0 bytes

In [253]:
new_parquet_read.index

DatetimeIndex(['2022-01-31', '2023-01-31', '2024-01-31', '2025-01-31',
               '2026-01-31', '2027-01-31', '2028-01-31', '2029-01-31',
               '2030-01-31', '2031-01-31', '2032-01-31', '2033-01-31',
               '2034-01-31', '2035-01-31', '2036-01-31', '2037-01-31',
               '2038-01-31', '2039-01-31', '2040-01-31', '2041-01-31',
               '2042-01-31', '2043-01-31', '2044-01-31', '2045-01-31'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [254]:
new_parquet_read.reset_index(inplace=True)

In [258]:
new_parquet_read['Date'] = new_parquet_read['Date'].dt.tz_localize('US/Eastern')

In [259]:
new_parquet_read.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24 non-null     datetime64[ns, US/Eastern]
 1   Sales   15 non-null     float64
dtypes: datetime64[ns, US/Eastern](1), float64(1)
memory usage: 512.0 bytes

In [260]:
new_parquet_read.to_parquet('new_test_tz.parquet')

In [261]:
reading_tz = pd.read_parquet('new_test_tz.parquet')

In [262]:
reading_tz.head()

                       Date  Sales
0 2022-01-31 00:00:00-05:00    NaN
1 2023-01-31 00:00:00-05:00    NaN
2 2024-01-31 00:00:00-05:00    NaN
3 2025-01-31 00:00:00-05:00    NaN
4 2026-01-31 00:00:00-05:00    NaN

In [263]:
reading_tz.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24 non-null     datetime64[ns, US/Eastern]
 1   Sales   15 non-null     float64
dtypes: datetime64[ns, US/Eastern](1), float64(1)
memory usage: 512.0 bytes

In [264]:
import pandas as pd
from pandas.tseries.holiday import AbstractHolidayCalendar, Holiday
from pandas.tseries.offsets import CustomBusinessDay